Tekla Open API Reference for Tekla Structures 2025
IGeometryNode Properties
The IGeometryNode type exposes the following members.
Properties
Name | Description
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (i.e. false if it was originally a user-defined part)
Top
See Also
Reference
IGeometryNode Interface
Tekla.Structures.Model Namespace